**necessary libraries**

In [1]:
import pandas as pd
import numpy as np

In [13]:
users=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user')
users

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

In [14]:
users=users['user_id|age|gender|occupation|zip_code'].str.split('|',expand=True)
users

       0   1  2              3      4
0      1  24  M     technician  85711
1      2  53  F          other  94043
2      3  23  M         writer  32067
3      4  24  M     technician  43537
4      5  33  F          other  15213
..   ...  .. ..            ...    ...
938  939  26  F        student  33319
939  940  32  M  administrator  02215
940  941  20  M        student  97229
941  942  48  F      librarian  78209
942  943  22  M        student  77841

[943 rows x 5 columns]

In [16]:
users.columns=['user_id','age','gender','occupation','zip_code']
users

    user_id age gender     occupation zip_code
0         1  24      M     technician    85711
1         2  53      F          other    94043
2         3  23      M         writer    32067
3         4  24      M     technician    43537
4         5  33      F          other    15213
..      ...  ..    ...            ...      ...
938     939  26      F        student    33319
939     940  32      M  administrator    02215
940     941  20      M        student    97229
941     942  48      F      librarian    78209
942     943  22      M        student    77841

[943 rows x 5 columns]

In [18]:
users=users.set_index('user_id')
users

        age gender     occupation zip_code
user_id
1        24      M     technician    85711
2        53      F          other    94043
3        23      M         writer    32067
4        24      M     technician    43537
5        33      F          other    15213
...      ..    ...            ...      ...
939      26      F        student    33319
940      32      M  administrator    02215
941      20      M        student    97229
942      48      F      librarian    78209
943      22      M        student    77841

[943 rows x 4 columns]

**first 10 and last 10 entries**

In [24]:
print('-------First 10 entries------')
print(users.head(10))
print()
print('-------Last 10 entries-------')
print(users.tail(10))

-------First 10 entries------
        age gender     occupation zip_code
user_id
1        24      M     technician    85711
2        53      F          other    94043
3        23      M         writer    32067
4        24      M     technician    43537
5        33      F          other    15213
6        42      M      executive    98101
7        57      M  administrator    91344
8        36      M  administrator    05201
9        29      M        student    01002
10       53      M         lawyer    90703

-------Last 10 entries-------
        age gender     occupation zip_code
user_id
934      61      M       engineer    22902
935      42      M         doctor    66221
936      24      M          other    32789
937      48      M       educator    98072
938      38      F     technician    55038
939      26      F        student    33319
940      32      M  administrator    02215
941      20      M        student    97229
942      48      F      librarian    78209
943      22      M        student    77841

the number of observations in the dataset

In [25]:
len(users)

943

**number of columns in the dataset**

In [26]:
len(users.T)

4

**the name of all the columns.**

In [28]:
users.keys()

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

**the dataset index**

In [29]:
users.index

Index(['1', '2', '3', '4', '5', '6', '7', '8', '9', '10',
       ...
       '934', '935', '936', '937', '938', '939', '940', '941', '942', '943'],
      dtype='object', name='user_id', length=943)

 the data type of each column

In [31]:
users.dtypes

age           object
gender        object
occupation    object
zip_code      object
dtype: object

In [34]:
users=users.astype({'age':int})
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**Print only the occupation column**

In [35]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

**How many different occupations are in this dataset?**

In [36]:
users['occupation'].nunique()

21

**What is the most frequent occupation?**

In [38]:
users['occupation'].mode()

0    student
Name: occupation, dtype: object

**DataFrame Info.**

In [39]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

**Describe all the columns**

In [40]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

**Summarize only the occupation column**

In [41]:
users['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

**What is the mean age of users?**

In [43]:
users['age'].mean()

34.05196182396607

**What is the age with least occurrence?**

In [44]:
users['age'].min()

7